Autodesk.Revit.DB.Structure.LoadType
This enum declares types of Loads.
Since:
2015

Autodesk.Revit.DB.Structure.LoadType.Area
Area Load

Autodesk.Revit.DB.Structure.LoadType.Line
Line Load

Autodesk.Revit.DB.Structure.LoadType.Point
Point Load